tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
brew 'autoconf'
brew 'bison'
brew 'boot2docker'
brew 'brew-cask'
brew 'docker'
brew 'fig'
brew 'freetype'
brew 'gdbm'
brew 'git'
brew 'go'
brew 'imagemagick'
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libpng'
brew 'libressl'
brew 'libtool'
brew 'libyaml'
brew 'mackup'
brew 'mysql'
brew 'nginx'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'postgresql'
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'sqlite'
brew 'tag'
brew 'terminal-notifier'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'xz'
cask 'bettertouchtool'
cask 'betterzipql'
cask 'cheatsheet'
cask 'clipmenu-alpha'
cask 'clipmenu-dev'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gimp'
cask 'google-chrome'
cask 'iterm2'
cask 'joinme'
cask 'libreoffice'
cask 'lunchy'
cask 'macdown'
cask 'pg-commander'
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'querious'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'skype'
cask 'sublime-text3'
cask 'tower'
cask 'ubersicht'
cask 'virtualbox'
cask 'vlc'
cask 'vmware-fusion'
cask 'webpquicklook'

