# -*- mode: ruby -*-
# vi: set ft=ruby :
#
# Brewfile
#   Requires aliasing the `brew` command to really stay not fall out of sync due
#   to commands being run manually.

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core", "git@github.com:Homebrew/homebrew-core.git"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Latest version of GNU Make (newer than XCode's GNU Make)
brew "make"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cross-platform make
brew "cmake"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
brew "svn"
# GNU multiple precision arithmetic library
brew "gmp"
# Portable Foreign Function Interface library
brew "libffi"
# Library for manipulating PNG images
brew "libpng"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Data compression library
brew "lzlib"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# GUI for vim, made for macOS
brew "macvim"
# Manage compile and link flags for libraries
brew "pkg-config"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD", "with-jansson", "with-libyaml"]

#Powerful command-line bookmark eanager
brew "buku"

brew "htop"
brew 'youtubedl'

# Completions
brew "zsh-completions"

# QUICKLOOK PLUGINS
#brew cask epubquicklook

# SECURITY
# Spoof your MAC address in macOS
brew "spoof-mac"
